# BeamSystem3dParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BeamSystem3dParam Property
ParameterTypeId Class See Also
---
"3D"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BeamSystem3dParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamSystem3dParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BeamSystem3dParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace